#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Настройки = кбп_Оповещения.НастройкиПользователя();
	Каналы = Настройки.Каналы;
	СпособГруппировки = Настройки.СпособГруппировки;
	ИнтервалМинут = Настройки.ИнтервалМинут;
	События.Загрузить(Настройки.События);

	Доступные = кбп_Оповещения.ДоступныеКаналы();
	Для Каждого ИмяПоля Из СтрРазделить("Каналы,СобытияКаналы", ",") Цикл
		Список = Элементы[ИмяПоля].СписокВыбора;
		Для Каждого Канал Из Доступные Цикл
			Список.Добавить(Канал.Значение, Канал.Представление);
		КонецЦикла;
		Если Доступные.Количество() > 1 Тогда
			Список.Добавить(СтрСоединить(Доступные.ВыгрузитьЗначения(), ", "), НСтр("ru = 'Все каналы'"));
		КонецЕсли;
	КонецЦикла;
	УстановитьВидимость();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособГруппировкиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()

	Настройки = Новый Структура("Каналы, СпособГруппировки, ИнтервалМинут", Каналы, СпособГруппировки, ИнтервалМинут);
	Настройки.Вставить("События", События.Выгрузить());
	кбп_Оповещения.ЗаписатьНастройкиПользователя(Настройки);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.ИнтервалМинут.Видимость =
		(СпособГруппировки = Перечисления.кбп_СпособыГруппировкиОповещений.РазВNМинут);
КонецПроцедуры

#КонецОбласти
