#Область ПрограммныйИнтерфейс

Процедура ОбработкаОчередиОповещений() Экспорт
	кбп_Оповещения.ОтправитьОчередь();
КонецПроцедуры

Процедура ОбработкаОчередиДействий() Экспорт
	кбп_Движок.ОбработатьОчередьДействий();
КонецПроцедуры

Процедура КонтрольСроков() Экспорт
	кбп_Движок.ЗавершитьЗамещения();
	кбп_Движок.ОбработатьОчередьДействий();
КонецПроцедуры

Процедура РассылкиПоРасписанию() Экспорт
	кбп_Оповещения.ВыполнитьРассылки();
КонецПроцедуры

Процедура ОчисткаЖурнала() Экспорт
	кбп_ПроцессыСлужебный.ОчиститьЖурнал();
КонецПроцедуры

#КонецОбласти
