#Область ПрограммныйИнтерфейс

Процедура ОбработкаОчередиОповещений() Экспорт
	кбп_Оповещения.ОтправитьОчередь();
КонецПроцедуры

Процедура ОбработкаОчередиДействий() Экспорт
	кбп_Движок.ОбработатьОчередьДействий();
КонецПроцедуры

Процедура КонтрольСроков() Экспорт
	кбп_Движок.ЗавершитьЗамещения();
	кбп_Движок.ОбработатьОчередьДействий();
КонецПроцедуры

Процедура РассылкиПоРасписанию() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура ОчисткаЖурнала() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

#КонецОбласти
