#Область ПрограммныйИнтерфейс

Процедура ОбработкаОчередиОповещений() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура ОбработкаОчередиДействий() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура КонтрольСроков() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура РассылкиПоРасписанию() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура ОчисткаЖурнала() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

#КонецОбласти
