#Область ПрограммныйИнтерфейс

// Возвращает код продукта базовой конфигурации: "ERP", "КА", "УТ", "УНФ", "БП", "УХ" или "Другое".
//
// Возвращаемое значение:
//  Строка
//
Функция ТекущийПродукт() Экспорт

	Имя = Метаданные.Имя;
	Если СтрНачинаетсяС(Имя, "УправлениеПредприятием") Тогда
		Возврат "ERP";
	ИначеЕсли СтрНачинаетсяС(Имя, "КомплекснаяАвтоматизация") Тогда
		Возврат "КА";
	ИначеЕсли СтрНачинаетсяС(Имя, "УправлениеТорговлей") Тогда
		Возврат "УТ";
	ИначеЕсли СтрНачинаетсяС(Имя, "УправлениеНебольшойФирмой") Тогда
		Возврат "УНФ";
	ИначеЕсли СтрНачинаетсяС(Имя, "Бухгалтерия") Тогда
		Возврат "БП";
	ИначеЕсли СтрНачинаетсяС(Имя, "УправлениеХолдингом") Тогда
		Возврат "УХ";
	КонецЕсли;
	Возврат "Другое";

КонецФункции

Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Процедура ОтправитьПочту(Письмо) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Функция РуководительПользователя(Пользователь) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция ПроизводственныйКалендарь() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция ДобавитьРабочиеЧасы(Дата, Часы) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция ТипыОбъектовДляПроцессов() Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция ПредставлениеОбъекта(Ссылка) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

#КонецОбласти
