#Область ПрограммныйИнтерфейс

Функция ЗапуститьПроцесс(Схема, Предмет = Неопределено, Переменные = Неопределено, Родитель = Неопределено) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция ВыполнитьДействие(Задача, ИдКнопки, Комментарий = "", ЗначенияПолей = Неопределено) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция ВернутьНаДоработку(Задача, ИдШагаВозврата, Комментарий) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Процедура Переадресовать(Задача, НовыйИсполнитель, Комментарий) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура ДобавитьКомментарий(Процесс, Текст, Задача = Неопределено, Файлы = Неопределено) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура Прервать(Процесс, Комментарий) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура Приостановить(Процесс, Комментарий = "") Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Процедура Продолжить(Процесс, Комментарий = "") Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецПроцедуры

Функция АктивныеПроцессыПредмета(Предмет) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция ЗадачиПользователя(Пользователь, Отбор = Неопределено) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

Функция СостояниеПроцесса(Процесс) Экспорт
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
КонецФункции

#КонецОбласти
