
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ИмяПольз = ИмяПользователя();
	ТекПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПольз, Истина); 
	Если Не ЗначениеЗаполнено(ТекПользователь) Тогда 
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент(); 
		НовыйПользователь.Наименование = ИмяПольз; 
		НовыйПользователь.Код = ИмяПольз; НовыйПользователь.Записать(); 
		ТекПользователь = НовыйПользователь.Ссылка; 
	КонецЕсли; 
	ПараметрыСеанса.ТекущийПользователь = ТекПользователь;
КонецПроцедуры
