#Область ПрограммныйИнтерфейс

Процедура ПриРегистрацииОбработчиков(Обработчики) Экспорт
	// Переопределяется расширением внедрения (&После).
КонецПроцедуры

Процедура ПриРегистрацииКаналов(Каналы) Экспорт
	// Переопределяется расширением внедрения (&После).
КонецПроцедуры

Процедура ПриОпределенииИсполнителей(Контекст, Исполнители, СтандартнаяОбработка) Экспорт
	// Переопределяется расширением внедрения (&После).
КонецПроцедуры

Процедура ПередЗапускомПроцесса(Схема, Предмет, Переменные, Отказ) Экспорт
	// Переопределяется расширением внедрения (&После).
КонецПроцедуры

Процедура ПриЗавершенииПроцесса(Процесс) Экспорт
	// Переопределяется расширением внедрения (&После).
КонецПроцедуры

Процедура ПриФормированииПанелиПроцесса(Форма, Предмет, Панель) Экспорт
	// Переопределяется расширением внедрения (&После).
КонецПроцедуры

#КонецОбласти
